In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df['FlightNumber'][1]=(10055.0)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [5]:
df['FlightNumber'][3]=10075.0

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [6]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [7]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [8]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [9]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [10]:
df['From']=([x.split('_')[0].capitalize() for x in df['From_To']])

In [11]:
df['From']

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [12]:
df['To']=([x.split('_')[1].capitalize() for x in df['From_To']])

In [13]:
df['To']

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [14]:
df['From']

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [15]:
df['To']

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: To, dtype: object

In [16]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [17]:
df.drop('From_To',inplace=True,axis=1)

In [18]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [21]:
df['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [89]:
col_delay=1
for arr in df['RecentDelays']:    
    for element in arr:   
      
           df[f'delay_{col_delay}']=pd.DataFrame(arr)
 
    col_delay+=1

In [90]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_3,delay_4,delay_5
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,24.0,13.0,67.0
1,10055,[],<Air France> (12),Madrid,Milan,47.0,43.0,NaN,32.0
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,NaN,87.0,NaN,NaN
3,10075,[13],12. Air France,Budapest,Paris,NaN,NaN,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,NaN,NaN,NaN,NaN